# Fonts (required for eza --icons)
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono-nerd-font"

# Core shell tools
brew "bash"
brew "antidote"
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "glow"
brew "jq"
brew "just"
brew "lazygit"
brew "mise"
brew "neovim"
brew "task"
brew "trash"
brew "zoxide"

# Worktree workflow (tap: satococoa/tap)
tap "satococoa/tap"
brew "satococoa/tap/wtp"

# Media
brew "ffmpeg"
brew "imagemagick"
