# Core shell tools
brew "antidote"
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "glow"
brew "just"
brew "lazygit"
brew "mise"
brew "neovim"
brew "task"
brew "zoxide"

# Media
brew "ffmpeg"
brew "imagemagick"
